iPig/src/InformationRegisters/ЖурналОсеменения/ЖурналОсеменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОсеменения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОпоросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаАбортаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк1</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк2</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПричины</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк1</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк2</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОценкаСлучки</name>
    <type>
      <types>EnumRef.ОценкаСлучки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоследнееСобытие</name>
  <attributes>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПоследнегоСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоследнееСобытие</name>
    <type>
      <types>EnumRef.ПоследнееСобытие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоследнееСобытие</name>
  <enumValues>
    <name>Случка</name>
  </enumValues>
  <enumValues>
    <name>УЗИ</name>
  </enumValues>
  <enumValues>
    <name>Опорос</name>
  </enumValues>
  <enumValues>
    <name>Отъем</name>
  </enumValues>
  <enumValues>
    <name>Ввод</name>
  </enumValues>
  <enumValues>
    <name>Выбытие</name>
  </enumValues>
  <enumValues>
    <name>Аборт</name>
  </enumValues>
</mdclass:Enum>

iPig/src/InformationRegisters/ЖурналОсеменения/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	ЗаписатьПоследнееСобытиеВРегистр();
КонецПроцедуры

Процедура ЗаписатьПоследнееСобытиеВРегистр()
	
	Перем Запись, ЗаписьСтатус, НаборЗаписей;
	
	Для Каждого Запись ИЗ ЭтотОбъект Цикл  	 
		
		НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
		НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
		НаборЗаписей.Прочитать();  
		
		
		Если НаборЗаписей.Количество() = 0  Тогда
			ЗаписьСтатус = РегистрыСведений.ПоследнееСобытие.СоздатьМенеджерЗаписи();
			ЗаписьСтатус.ДатаВвода 				= Запись.ДатаВвода;
			ЗаписьСтатус.НомерЖивотного 		= Запись.НомерЖивотного;
			ЗаписьСтатус.ДатаПоследнегоСобытия 	=  Запись.Период;  
			ЗаписьСтатус.ПоследнееСобытие 		= Перечисления.ПоследнееСобытие.Случка;  
			ЗаписьСтатус.УшнойВыщип				= Запись.УшнойВыщип;
			ЗаписьСтатус.НомерЖивотногоХряк	 	= Запись.НомерЖивотногоХряк;
			ЗаписьСтатус.НомерОпороса     		= Запись.НомерОпороса;
			ЗаписьСтатус.Записать(Истина);
		Иначе                             
			Для Каждого ЗаписьСтатус ИЗ НаборЗаписей Цикл
				Если (Запись.НомерОпороса >= ЗаписьСтатус.НомерОпороса)  И (Запись.Период > ЗаписьСтатус.ДатаПоследнегоСобытия) Тогда
					ЗаписьСтатус.ДатаВвода 				= Запись.ДатаВвода;
					ЗаписьСтатус.НомерЖивотного 		= Запись.НомерЖивотного;
					ЗаписьСтатус.ДатаПоследнегоСобытия 	= Запись.Период;  
					ЗаписьСтатус.ПоследнееСобытие 		= Перечисления.ПоследнееСобытие.Случка;
					ЗаписьСтатус.НомерЖивотногоХряк	 	= Запись.НомерЖивотногоХряк;
					ЗаписьСтатус.УшнойВыщип				= Запись.УшнойВыщип;  
					ЗаписьСтатус.НомерОпороса    		= Запись.НомерОпороса;
				КонецЕсли;					
			КонецЦикла;     
			НаборЗаписей.Записать(Истина);
		КонецЕсли;		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)   
	Для Каждого Запись ИЗ ЭтотОбъект Цикл 
		НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
		НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
		НаборЗаписей.Прочитать(); 
		Если НаборЗаписей.Количество() = 1 Тогда 
			Если НаборЗаписей[0].ПоследнееСобытие = Перечисления.ПоследнееСобытие.Случка И  НаборЗаписей[0].ДатаПоследнегоСобытия >= Запись.Период И Запись.НомерОпороса = 0 Тогда  
				Сообщить("Для свиноматки " + Запись.НомерЖивотного + " Дата случки должна быть больше " + Формат(НаборЗаписей[0].ДатаПоследнегоСобытия,"ДФ=dd.MM.yy"));
				Если НЕ Константы.ОтключитьКонтрольОшибок.Получить() Тогда
					Отказ = Истина;	
					ВызватьИсключение("Для свиноматки " + Запись.НомерЖивотного + " Дата случки должна быть больше " + Формат(НаборЗаписей[0].ДатаПоследнегоСобытия,"ДФ=dd.MM.yy")); 
				КонецЕсли;
			ИначеЕсли НаборЗаписей[0].ПоследнееСобытие = Перечисления.ПоследнееСобытие.Опорос И Запись.НомерОпороса = 0	Тогда
				Сообщить("Для свиноматки " + Запись.НомерЖивотного + " не внесен отъем.");
				Если НЕ Константы.ОтключитьКонтрольОшибок.Получить() Тогда 
					Отказ = Истина;	
					ВызватьИсключение("Для свиноматки " + Запись.НомерЖивотного + " не внесен отъем.");
				КонецЕсли;
			ИначеЕсли НаборЗаписей[0].ПоследнееСобытие = Перечисления.ПоследнееСобытие.Отъем И 
				(Запись.НомерОпороса = 0 ИЛИ НаборЗаписей[0].НомерОпороса < Запись.НомерОпороса) И
				(НаборЗаписей[0].ДатаПоследнегоСобытия >= Запись.Период) Тогда 
				Сообщить("Для свиноматки " + Запись.НомерЖивотного + " Дата случки должна быть больше " + Формат(НаборЗаписей[0].ДатаПоследнегоСобытия,"ДФ=dd.MM.yy")); 
				Если НЕ Константы.ОтключитьКонтрольОшибок.Получить() Тогда					
					Отказ = Истина;
					ВызватьИсключение("Для свиноматки " + Запись.НомерЖивотного + " Дата случки должна быть больше " + Формат(НаборЗаписей[0].ДатаПоследнегоСобытия,"ДФ=dd.MM.yy")); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
